app/controllers/images_controller.rb

INSERT INTO "images" ("photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	images = params["user"]["images_attributes"]
  	  images.each_with_index do |image, idx|
        current_user.images.create(photo: image[1]['photo'].tempfile)